spaxxomatic/esp8266_iot_node/src/mqtt_sensor_actor.cpp
}

#define WDT_TIMEOUT 8

void setup(void) {
  Serial.begin(115200);
  Serial.setTimeout(1000);
  Serial.println();
  Serial.println("Boot..");
  pinMode(LED_BUILTIN, OUTPUT);
  pinMode(LED_FLASH, OUTPUT);
  // flip the pin every 0.3s
  BLINK_STARTING;
  
  #ifdef HAS_MOTION_SENSOR
  attachInterrupt(digitalPinToInterrupt(MOTION_SENSOR_PIN), motion_sensor_irq, FALLING);
  #endif
  byte mac[6];
  WiFi.macAddress(mac);
  sprintf(str_mac,"%02x%02x%02x%02x%02x%02x",mac[0],mac[1],mac[2], mac[3], mac[4], mac[5]  );
  sprintf(actor_topic, "/actor/%s", str_mac);
  sprintf(config_topic, "/config/%s", str_mac);
  
  sprintf(sensor_topic, "/sensor/%s", str_mac);
  sprintf(report_topic, "/report/%s", str_mac);
  Serial.println(str_mac);
  SERIAL_DEBUGC(" Free: ") ;
  SERIAL_DEBUG(ESP.getFreeSketchSpace());
  //set up timer
  #ifdef ESP32
     //The timer’s counter divider is used as a divisor of the incoming 80 MHz APB_CLK clock.
    ioHandlerTimer = timerBegin(0, 8000, true);  // Timer 0, divider 80000 (1000 Hz tick)
    // Attach onTimer function to our timer.        
    timerAttachInterrupt(ioHandlerTimer, ioTimerCallback, true);  // Attach callback function
    timerAlarmWrite(ioHandlerTimer, OS_MAIN_TIMER_MS*10, true);
    timerAlarmEnable(ioHandlerTimer);  // Enable the timer        
  #else
    os_timer_setfn(&ioHandlerTimer, ioTimerCallback, NULL);
    os_timer_arm(&ioHandlerTimer, OS_MAIN_TIMER_MS, true);
  #endif
  
  EepromConfig.begin();
    
  http.setReuse(true);
  #ifdef ESP32
  
  void onWifiEvent(WiFiEvent_t event) ;
  
  WiFi.onEvent(onWifiEvent);

  #else
  WiFi.onStationModeGotIP(onWifiConnect);
  WiFi.onStationModeDisconnected(onWifiDisconnect);
  #endif
  
  if (EepromConfig.readEepromParams()){ //if we have saved params, try to connect the wlan
  
  Serial.print("MQTT srv parms");
  Serial.print(EepromConfig.settings.mqtt_server);
  Serial.print(EepromConfig.settings.mqtt_username);
  Serial.print(EepromConfig.settings.mqtt_password);
  
  WiFi.hostByName(EepromConfig.settings.mqtt_server, mqttServerIp) ;

  mqttClient.setServer(mqttServerIp, 1883);  
  mqttClient.setCredentials(EepromConfig.settings.mqtt_username, EepromConfig.settings.mqtt_password);
  mqttClient.onConnect(onMqttConnect);
  mqttClient.onDisconnect(onMqttDisconnect);
  mqttClient.onSubscribe(onMqttSubscribe);
  mqttClient.onMessage(onMqttMessage);
  mqttClient.setKeepAlive(10).setCleanSession(true).setClientId(str_mac)
    .setWill(sensor_topic, 0, true, "OFFLINE");;
         
  } else {
    state_autoconfig_mode = AUTOCONF_START ;
  }
  #ifdef ESP32
  esp_task_wdt_init(WDT_TIMEOUT, true); //enable panic so ESP32 restarts
  esp_task_wdt_add(NULL); //add current thread to WDT watch
  #else
  ESP.wdtEnable(5000);
  #endif
  pinMode(ACTOR_PIN, OUTPUT);
  #ifdef HAS_BUTTON
  pinMode(BUTTON_PIN, INPUT_PULLUP);
  #endif
  
  START_WIFI_CONNCHECK_TIMER;
  BLINK_STOP;  
  //enable PWM on led pin
  #ifndef ESP32
  analogWriteFreq(100); // Hz freq
  #endif
  timer_heartbeat.attach(EepromConfig.settings.log_freq, timer_heartbeat_handler);
  
 }

volatile bool f_wifi_conn_in_progress = false;
int cnt_wlan_connectionerror = 0;
#define INCR_WLAN_CONN_ERR_AND_RETURN cnt_wlan_connectionerror++; f_wifi_conn_in_progress = false; return ;
#define RST_WLAN_CONN_ERR cnt_wlan_connectionerror = 0;

#ifdef ESP32

void connected_to_ap(WiFiEvent_t wifi_event, WiFiEventInfo_t wifi_info){
    Serial.println("[+] Connected to the WiFi network");
}

void disconnected_from_ap(WiFiEvent_t wifi_event, WiFiEventInfo_t wifi_info){
    Serial.println("[-] Disconnected from the WiFi AP");
}

void got_ip_from_ap(WiFiEvent_t wifi_event, WiFiEventInfo_t wifi_info){
    Serial.print("[+] Local ESP32 IP: ");
    Serial.println(WiFi.localIP());
}

#endif

void connectToWifi(){
  
  if (f_wifi_conn_in_progress) {
    Serial.print ("Wifi conn in progress");
    return;  
  }

  if (WiFi.status() == WL_CONNECTED){
      Serial.print ("Already connected");
      return;
  }

  char* ssid = EepromConfig.settings.ssid;
  char* passwd =  EepromConfig.settings.password;
  
  Serial.println ("Ck Wi-Fi ");

  f_wifi_conn_in_progress = true;

  if (state_autoconfig_mode >= AUTOCONF_START){    
    strcpy(ssid,  WIFI_AP_CONFIG);
    strcpy(passwd,  WIFI_AP_CONFIG_PW);
     
  }  
  
  Serial.print (" Wi-Fi ");
  Serial.print (ssid);
  Serial.println (passwd);
  WiFi.persistent(false);
  WiFi.mode(WIFI_STA);
  #ifdef ESP32
  WiFi.setSleep(WIFI_PS_MIN_MODEM);
  #else
  WiFi.setSleepMode(WIFI_NONE_SLEEP);  
  #endif
  WiFi.setAutoReconnect(false);  
  wl_status_t status = WiFi.begin(ssid, passwd) ;
  if (status == WL_CONNECT_FAILED){
    Serial.println ("Conn failed");
    INCR_WLAN_CONN_ERR_AND_RETURN;
  };
  #ifdef ESP32
  if (status == WL_NO_SSID_AVAIL || status == WL_CONNECT_FAILED ){
    Serial.println ("No SSID or connect failed");
    INCR_WLAN_CONN_ERR_AND_RETURN;  
  }
  if (status == WL_CONNECTION_LOST){
    Serial.println ("Conn lost");
    INCR_WLAN_CONN_ERR_AND_RETURN;  
  }  
  #else  
  if (status == STATION_CONNECT_FAIL){  
    Serial.println ("Conn fail");
    INCR_WLAN_CONN_ERR_AND_RETURN;
  }; 
  if (status == STATION_IDLE){
    Serial.println ("err idle");
    INCR_WLAN_CONN_ERR_AND_RETURN;
  }; 
  #endif   
  if (WiFi.status() == WL_DISCONNECTED){
    //WL_DISCONNECTED means usually that credentials are not valid
    Serial.println ("CW disconnected");
    INCR_WLAN_CONN_ERR_AND_RETURN;
  }

  f_wifi_conn_in_progress = false;

}

#if defined(ESP32)
void onWifiEvent(WiFiEvent_t event) {
    Serial.printf("[WiFi event]: %s\n", WiFi.eventName(event));
    switch(event) {
    case SYSTEM_EVENT_STA_GOT_IP:
        STOP_WIFI_CONNCHECK_TIMER;
        Serial.print("Connected to Wi-Fi. IP: ");
        Serial.println(WiFi.localIP());
                
        if (state_autoconfig_mode == AUTOCONF_DISABLED){ 
          WiFi.persistent(true);
          ENABLE_MQTT_CHECK_TIMER;          
        }else{
          Serial.print("Autoconf wifi connected ");
          state_autoconfig_mode = AUTOCONF_WIFI_CONNECTED;
        }
        break;
    case SYSTEM_EVENT_STA_DISCONNECTED:
        BLINK_ERROR;    
        Serial.print("Lost Wi-Fi ");
        Serial.print(WiFi.SSID());
        
        DISABLE_MQTT_CHECK_TIMER;
        yield();
        if (WiFi.status() == WL_CONNECTED) { // handles wrong state report
          Serial.println("Status is wrong, disconnect");
          resetWiFi();
        }         
        START_WIFI_CONNCHECK_TIMER;
        break;
    }
}

#else
void onWifiConnect(const WiFiEventStationModeGotIP& event)
{
  STOP_WIFI_CONNCHECK_TIMER;
  Serial.println("Connected to Wi-Fi.");
  Serial.println(WiFi.localIP());
  WiFi.onStationModeDisconnected(onWifiDisconnect);
  //only make conn persistent if we're not in config mode
  if (state_autoconfig_mode == AUTOCONF_DISABLED){      
    //if we reached this place, we're connected
    ENABLE_MQTT_CHECK_TIMER;
    Serial.print("Connected. IP: ");
    WiFi.persistent(true);
  }else{
    Serial.print("Autoconf wifi connected ");
    state_autoconfig_mode = AUTOCONF_WIFI_CONNECTED;
  }
  Serial.println(WiFi.localIP());  
}

void onWifiDisconnect(const WiFiEventStationModeDisconnected& event)
{
  BLINK_ERROR;    
  Serial.print("Lost Wi-Fi ");
  Serial.print(event.ssid);
  Serial.print(" ");
  Serial.println (event.reason);
  
  DISABLE_MQTT_CHECK_TIMER;
  
  if (WiFi.status() == WL_CONNECTED) { // handles wrong state report
    Serial.println("Status is wrong, disconnect");
    resetWiFi();
  } 
  
  START_WIFI_CONNCHECK_TIMER;
}
#endif
// ----------------------------------------------------------------------

const char jsonFormatBattOnly[] = "{\"batt\":%s}";
const char jsonFormatErr[] = "{\"error\":\"%s\"}";
const char jsonFormatReport[] = "{\"fw\":\"%d\",\"location\":\"%s\",\"cap\":\"%s\", \"lasterr\":\"%s\"}";

