spaxxomatic/esp8266_iot_node/src/mqtt_sensor_actor.cpp
float batt_voltage=0.00f;
char tbuff[8];
char hbuff[8];
char bvbuff[8];

void sendHeartbeat(){
  //batt_voltage = ESP.getVcc()/(float)1000;
  //snprintf(tempTopicBuffer, sizeof(tempTopicBuffer), "%s/data", sensor_topic);
  //sprintf(tempSendPayloadBuffer,jsonFormatBattOnly, dtostrf(batt_voltage, 6, 2, bvbuff));
  //if (mqttClient.publish(tempTopicBuffer, 1, true, tempSendPayloadBuffer) == 0){
  //   SERIAL_DEBUGC("\n MQTT err send.") ;
  //};
  SERIAL_DEBUG("Sending HB") ;  
  writeOnlineState();
}

void mqtt_check_conn(){ //retry reconnect should be called periodically by the chk_connect timer 
    SERIAL_DEBUG("MQTT CKCON") ;   
    if (!mqttClient.connected()){    
        mqttClient.disconnect(true);
        SERIAL_DEBUG("MQTT reconnect ..") ;
        yield();  
        mqttClient.connect();
    }
}

void loop_serial(){
  check_serial_cmd(); //serial command avail?
  yield();
}

void loop_autoconf_state(){
  switch (state_autoconfig_mode){
    case AUTOCONF_START:
    case  AUTOCONF_CONNECT_WIFI :
      enterConfigWifi(); break;
    case AUTOCONF_WIFI_CONNECTED:
      state_autoconfig_mode = AUTOCONF_GET_CONFIG;
    case AUTOCONF_GET_CONFIG:
      getStoreConnstring(); break;
    case AUTOCONF_GET_CONFIG_PROGRESS: break;
      //just wait 
    case AUTOCONF_GET_CONFIG_ERROR: 
      // if there was an error, retrigger it
      TRIGGER_GET_CONFIG_CONNSTR; break;      
    case AUTOCONF_CONFIG_STORED:       
      esp_bugfree_restart(); break;
      
    default: break;
  } 
  yield();
}

void loop_connstack(){
    /* ----------- Communication handlinng -------------*/
  if (f_mqtt_reconnect){ 
      f_mqtt_reconnect = false;
      mqtt_check_conn();
    }
  yield();
}

void loop_mqtt(){
  if (sendActorState){
    sendActorState = false;
    snprintf(tempTopicBuffer, sizeof(tempTopicBuffer), "%s/state", actor_topic);
    itoa(EepromConfig.settings.actor_state,tempSendPayloadBuffer,10);
    if (mqttClient.publish(tempTopicBuffer, 1, true, tempSendPayloadBuffer) == 0){
      SERIAL_DEBUG("MQTT pub failed") ;
      BLINK_ERROR;      
    }else{
      BLINK_STOP;
    };  
    yield();
  }
  if (bSendHeartbeat){
      bSendHeartbeat = false;
      sendHeartbeat();
      yield();
  }  
  if (f_subscribe){
      f_subscribe = false;
      handleSubscribe();
      yield();
  }  
  if (sem_lock_tempReceivePayloadBuffer == SEM_BUFF_AWAITPROCESS){    
      //we received a config message, process it async    
      handleConfigMsg();
      sem_lock_tempReceivePayloadBuffer = SEM_BUFF_FREE;      
      yield();
  }    
  if (f_deleteRemoteConfig){
      f_deleteRemoteConfig = false;
      mqttClient.publish(config_topic, 1, false);
      yield();
  }  
  if (f_SendConfigReport){
      f_SendConfigReport = false;  
      char lasterr[EEPARAM_LASTERR_LEN] ;
      EepromConfig.get_lasterr(lasterr);
      lasterr[EEPARAM_LASTERR_LEN-1] = '\0'; //buffer overflow protection
      sprintf(tempSendPayloadBuffer,jsonFormatReport, FW_VERSION, EepromConfig.settings.location, CAPABILITIES, lasterr);
      mqttClient.publish(report_topic, 1, true, tempSendPayloadBuffer);
      yield();
  }

}

void loop_hw_io(){
  //inputs handling
  if (ioHandlerTick){
    ioHandlerTick = false;
    //we read the button state only once every tick, (debouncing)
    #ifdef HAS_BUTTON
    uint8_t val = digitalRead(BUTTON_PIN);  // read input value
     if (val == HIGH) {  //check if the input is HIGH (button released)
       iButtonState = 0;
     } else {
       iButtonState += 1; //increment, but only the value 1 will trigger an action
     }
     if (iButtonState == 1){
       //only the first press after a depress shall trigger a state change
       actor_toggle();
     }
     if (iButtonState >= 20){ // around 20*0.2 seconds 
       //4 presses - enter wifi manager
       Serial.println("BP->Enter config");
       if (state_autoconfig_mode == AUTOCONF_DISABLED || state_autoconfig_mode == AUTOCONF_GET_CONFIG_ERROR){
        command_enter_config(nullptr);
       }
     }     
    #endif
    
    if (!blinker.active()){
      /* show normal operation by dimming the LED up and down */  
      pwmval+=pwmdir;
      analogWrite(LED_BUILTIN, pwmval);
      if (pwmval >=980) pwmdir = -50;
      if (pwmval <= 40) pwmdir = 50;
    }    
  }
}


void handleSubscribe(){  
  writeOnlineState();
  mqttClient.subscribe(actor_topic, 2);  
  mqttClient.subscribe(config_topic, 2);    
}

bool handleConfigMsg(){
    if (sem_lock_tempReceivePayloadBuffer == SEM_BUFF_WRITING){
      SERIAL_DEBUG ("! bufflock");  
      SERIAL_DEBUG (tempReceivePayloadBuffer);
      return false;
    }
    sem_lock_tempReceivePayloadBuffer = SEM_BUFF_READING;
    SERIAL_DEBUG ("HCM");
    SERIAL_DEBUG (tempReceivePayloadBuffer);
    JsonObject& jsonRoot = jsonBuffer.parseObject(tempReceivePayloadBuffer); 
    // Test if parsing succeeds.
    if (!jsonRoot.success()) {
        SERIAL_DEBUG("Payld parse fail");        
    }else{    
        int deepsleep = jsonRoot["deepsleep"];
        if (deepsleep > 0){
            EepromConfig.store_deepsleep(deepsleep);
            SERIAL_DEBUGC ("Deepsleep value set to ");
            SERIAL_DEBUG (deepsleep);
        }
        const char*  location = jsonRoot["location"];
        //root.prettyPrintTo(Serial);
        if (location){
          SERIAL_DEBUG ("Set location");
          EepromConfig.store_location(location);
          //delete config and delete it
        }
        int log_freq = jsonRoot["log_freq"];
        if (log_freq){
          SERIAL_DEBUGC ("Set log_freq");
          SERIAL_DEBUG (log_freq);
          if (log_freq > 0){
            EepromConfig.store_log_freq(log_freq);
            timer_heartbeat.detach();
            timer_heartbeat.attach(EepromConfig.settings.log_freq, timer_heartbeat_handler);
          }else{
            SERIAL_DEBUG ("No freq value");
          }
        }
        int report = jsonRoot["report"];
        if (report){
          f_SendConfigReport = true;
        }  
        uint16_t update_firmware_version = jsonRoot["update"];
        if (update_firmware_version){
          SERIAL_DEBUGC ("Set update FW ");
          command_trigger_update(update_firmware_version);
        }                
        
