spaxxomatic/esp8266_iot_node/src/mqtt_sensor_actor.cpp
        #ifdef HAS_MOTION_SENSOR
        int val = jsonRoot["motion_sensor_timer"];
        if (val){
          SERIAL_DEBUGC ("Set motion_sensor_timer: ");
          SERIAL_DEBUG (val);
          if (val >= MOTION_SENSOR_DEFAULT_TIMER){
            EepromConfig.storeMotionSensorOffTimer(val);
          }else{
            SERIAL_DEBUG ("Invalid mot sensor timer val");
          }
        }
        #endif
        //f_deleteRemoteConfig = true;
    }    
    jsonBuffer.clear();    
    return true;    
}

void handleActorMsg(char* payload, int length){
  SERIAL_DEBUG ("H_AM");  
  if (length > 0){
    if (payload[0] == '0'){
      actor_off();
      sensorMode = MODE_SENSOR_ENABLED;
    }else{
      if (payload[0] == MODE_SENSOR_DISABLED) { //this is a special value for "permanent on"
        sensorMode = MODE_SENSOR_DISABLED;
        SERIAL_DEBUG ("sensor dis");
        actor_on(true);
      }else{
        SERIAL_DEBUG ("sensor en");
        sensorMode = MODE_SENSOR_ENABLED;
        actor_on(false);
      }
    }
  }

}

void loop(void) {
  yield();
  //delay(50);
  #ifdef ESP32
  esp_task_wdt_reset();
  #endif
  loop_hw_io();
  loop_serial();
  
  //BLE works, but RAM is not enough and we are getting core dumps on disconnect
  #ifdef ESP32
  loop_ble();
  #endif
  
  if (state_autoconfig_mode > AUTOCONF_DISABLED){
    //we are in autoconf mode, handle only the autoconf loop
    loop_autoconf_state();
  }else{
    loop_mqtt();
    loop_connstack();  
  }
}

void command_reset	(char* params){
		Serial.println("Reset");
    mqttClient.disconnect(true);
    delay(400);
		WiFi.disconnect();
    delay(400);
    esp_bugfree_restart();
    delay(100);
}

void command_enter_config	(char* params){
		Serial.println("Enter conf");
    mqttClient.disconnect(true);
		WiFi.disconnect();
    state_autoconfig_mode = AUTOCONF_START;
}

#ifdef ESP32
void command_ble (char* params){
		if (strcmp(params, " on") >= 0){
      Serial.println("Enable BLE"); 
      mqttClient.disconnect(true);
      delay(40);
		  WiFi.disconnect();
      delay(40);
      enable_ble(); 
      return;
    }
		else if (strcmp(params, " off") >= 0){
      Serial.println("Disable BLE");  
      disable_ble();
      return;
    }
    Serial.println("on ? off ?");          
}
#endif